## Terraform Plan
#### Terraform Format: `success`
#### Terraform Plan: `success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
module.gcp_iam.google_service_account.vertex_account: Refreshing state... [id=projects/aitech-good-s17919/serviceAccounts/vertex-account@aitech-good-s17919.iam.gserviceaccount.com]
module.gcp_vpc.google_compute_network.ml_network: Refreshing state... [id=projects/aitech-good-s17919/global/networks/ml-network]
module.gcp_iam.google_project_iam_member.vertex_account_user: Refreshing state... [id=aitech-good-s17919/roles/aiplatform.user/serviceAccount:vertex-account@aitech-good-s17919.iam.gserviceaccount.com]
module.gcp_vpc.google_compute_subnetwork.ml_network_subnet: Refreshing state... [id=projects/aitech-good-s17919/regions/asia-northeast1/subnetworks/ml-network-subnet]
module.gcp_vpc.google_compute_firewall.ml_network_allow_ssh: Refreshing state... [id=projects/aitech-good-s17919/global/firewalls/ml-network-allow-ssh]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gcp_gcs.google_storage_bucket.vertex will be created
  + resource "google_storage_bucket" "vertex" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "aitech-good-s17919-vertex"
      + project                     = "aitech-good-s17919"
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = (known after apply)
        }

      + website {
          + main_page_suffix = (known after apply)
          + not_found_page   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>